# 3. Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить, к какому времени года
# относится месяц (зима, весна, лето, осень). Напишите решения через list и dict.
#
li = ["Зима", "Весна", "Лето", "Осень"]

month = int(input("Введите номер месяца от 1 до 12: "))

if 1 <= month <= 2 or month == 12:
        print(li[0])
elif 3 <= month <= 5:
        print(li[1])
elif 6 <= month <= 8:
    print(li[2])
else:
    print(li[3])


dict = {1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето", 7: "Лето", 8: "Лето", 9: "Осень", 10: "Осень", 11: "Осень", 12: "Зима"}

month = int(input("Введите номер месяца от 1 до 12: "))

print(dict[month])